ServiceDesk/src/Catalogs/БазыДанных/БазыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БазыДанных</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Актуальная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>EnumRef.ПлатформыВнешнихИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольРелизов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольРобота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательРобот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сервер1С</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверSQL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тестировщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлНастройки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ServiceDesk/src/InformationRegisters/ПраваДоступаКИнформационнымСистемам/ПраваДоступаКИнформационнымСистемам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПраваДоступаКИнформационнымСистемам</name>
  <dimensions>
    <name>ИнформационнаяСистема</name>
    <type>
      <types>CatalogRef.БазыДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ServiceDesk/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ДляНовыхЗаявок</name>
      <description>Для новых заявок</description>
    </items>
  </predefined>
  <attributes>
    <name>ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SYNC_TIME</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аутентификация</name>
    <comment>Windows аутентификация</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аутсорсинг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесНаправление</name>
    <type>
      <types>EnumRef.БизнесНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяБаза</name>
    <type>
      <types>CatalogRef.БазыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОтправлятьОповещенияНаПочту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменитьПарольПриВходе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Уволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ServiceDesk/src/Catalogs/БазыДанных/ManagerModule.bsl
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПоляПредставления = Новый Массив;
	ПоляПредставления.Добавить("Наименование");
	ПоляПредставления.Добавить("Организация");
	
	Поля = ПоляПредставления;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление	= "" + Данные.Наименование + " (" + Данные.Организация + ")";
	
КонецПроцедуры

Функция ПроверитьДоступностьИнформационнойСистемыПользователямЗаявки(Заявка) Экспорт
	
	СтруктураОтвета	= Новый Структура;
	
	Если Не Заявка.База1С.Пустая() И Заявка.Исполнитель <> Справочники.Пользователи.ДляНовыхЗаявок Тогда
		
		пЗапрос	= Новый Запрос;
		пЗапрос.Текст	= "ВЫБРАТЬ
		             	  |	ПраваДоступаКИнформационнымСистемам.ИнформационнаяСистема КАК ИнформационнаяСистема
		             	  |ИЗ
		             	  |	РегистрСведений.ПраваДоступаКИнформационнымСистемам КАК ПраваДоступаКИнформационнымСистемам
		             	  |ГДЕ
		             	  |	ПраваДоступаКИнформационнымСистемам.ИнформационнаяСистема = &ИнформационнаяСистема
		             	  |	И ПраваДоступаКИнформационнымСистемам.Пользователь = &Заказчик
		             	  |;
		             	  |
		             	  |////////////////////////////////////////////////////////////////////////////////
		             	  |ВЫБРАТЬ
		             	  |	ПраваДоступаКИнформационнымСистемам.ИнформационнаяСистема КАК ИнформационнаяСистема
		             	  |ИЗ
		             	  |	РегистрСведений.ПраваДоступаКИнформационнымСистемам КАК ПраваДоступаКИнформационнымСистемам
		             	  |ГДЕ
		             	  |	ПраваДоступаКИнформационнымСистемам.ИнформационнаяСистема = &ИнформационнаяСистема
		             	  |	И ПраваДоступаКИнформационнымСистемам.Пользователь = &Исполнитель
		             	  |;
		             	  |
		             	  |////////////////////////////////////////////////////////////////////////////////
		             	  |ВЫБРАТЬ
		             	  |	ПраваДоступаКИнформационнымСистемам.ИнформационнаяСистема КАК ИнформационнаяСистема
		             	  |ИЗ
		             	  |	РегистрСведений.ПраваДоступаКИнформационнымСистемам КАК ПраваДоступаКИнформационнымСистемам
		             	  |ГДЕ
		             	  |	ПраваДоступаКИнформационнымСистемам.ИнформационнаяСистема = &ИнформационнаяСистема
		             	  |	И ПраваДоступаКИнформационнымСистемам.Пользователь = &тестировщик";
		
		пЗапрос.УстановитьПараметр("ИнформационнаяСистема", Заявка.База1С);
		пЗапрос.УстановитьПараметр("Заказчик", Заявка.Заказчик);
		пЗапрос.УстановитьПараметр("Исполнитель", Заявка.Исполнитель);
		пЗапрос.УстановитьПараметр("Тестировщик", Заявка.Тестировщик);
		
		РезультатыЗапроса	= пЗапрос.ВыполнитьПакет();
		
		РезультатЗапроса	= РезультатыЗапроса[0];
		Если РезультатЗапроса.Пустой() И Не Заявка.Заказчик.Пустая() Тогда
			СтруктураОтвета.Вставить("Заказчик", "У заказчика нет доступа к информационной системе");
		КонецЕсли;
		
		РезультатЗапроса	= РезультатыЗапроса[1];
		Если РезультатЗапроса.Пустой() И Не Заявка.Исполнитель.Пустая() Тогда
			СтруктураОтвета.Вставить("Исполнитель", "У исполнителя нет доступа к информационной системе");
		КонецЕсли;
		
		РезультатЗапроса	= РезультатыЗапроса[2];
		Если РезультатЗапроса.Пустой() И Не Заявка.Тестировщик.Пустая() Тогда
			СтруктураОтвета.Вставить("Тестировщик", "У тестировщика нет доступа к информационной системе");
		КонецЕсли;
		
	КонецЕсли;

	Возврат СтруктураОтвета;
	
КонецФункции
